
function dealTreeData(arr){
  arr.forEach(ele=>{
    ele.expand=true
    ele.title=ele.name + " "+ ele.id
    ele.value=ele.id
    // if(self.currentUser.Authority.includes(ele.id)){
    //   ele.checked=true
    // }
    if(ele.item && ele.item.length){
      ele.children=ele.item
      dealTreeData(ele.item)
    }
  })
}

window.allTreeData= [
  {
    id: 110000,
    name: "校宝秀",
    item: [
      {
        id: 110010,
        name: "使用移动端校宝秀招生工具",
        relType: "consolt",
        ref: 120000,
        checked:true
      },
      {
        id: 110020,
        name: "校宝钱包"
      },
      {
        id: 110030,
        name: "商品管理"
      },
      {
        id: 110040,
        name: "订单管理"
      }
    ]
  },
  {
    id: 120000,
    name: "咨询本",
    item: [
      {
        id: 120180,
        name: "新增咨询"
      },
      {
        id: 120190,
        name: "导入咨询"
      },
      {
        id: 120010,
        name: "查看销售员/售前人员是我的咨询记录",
        type: "consolt"
      },
      {
        id: 120020,
        name: "查看管辖校区所有咨询记录",
        type: "consolt"
      },
      {
        id: 120050,
        name: "支持跨校区精确查询学员"
      },
      {
        id: 120080,
        name: "编辑我的咨询的跟进信息",
        type: "keepgoing"
      },
      {
        id: 120082,
        name: "编辑所有咨询的跟进信息",
        type: "keepgoing"
      },
      {
        id: 120090,
        name: "编辑跟进信息时，可修改销售员、经办校区"
      },
      {
        id: 120091,
        name: "编辑跟进信息时，可修改渠道"
      },
      {
        id: 120060,
        name: "分配咨询给销售员"
      },
      {
        id: 120073,
        name: "批量删除咨询记录"
      },
      {
        id: 120070,
        name: "导出咨询记录"
      },
      {
        id: 120030,
        name: "沟通管理"
      },
      {
        id: 120100,
        name: "编辑、删除自己创建的沟通",
        type: "commucate"
      },
      {
        id: 120110,
        name: "编辑、删除所有沟通",
        type: "commucate"
      },
      {
        id: 120170,
        name: "编辑沟通记录时可以修改沟通时间"
      },
      {
        id: 120075,
        name: "导出沟通记录"
      },
      {
        id: 120200,
        name: "新建渠道"
      },
      {
        id: 120040,
        name: "渠道列表"
      },
      {
        id: 120210,
        name: "渠道分类列表"
      },
      {
        id: 120120,
        name: "办理试听"
      },
      {
        id: 120130,
        name: "查看操作人是我的试听记录",
        type: "audition"
      },
      {
        id: 120140,
        name: "查看管辖校区所有试听记录",
        type: "audition"
      },
      {
        id: 120150,
        name: "编辑操作人是我的试听状态",
        type: "editaudition"
      },
      {
        id: 120160,
        name: "编辑所有咨询的试听状态",
        type: "editaudition"
      },
      {
        id: 120310,
        name: "新建/编辑试听活动"
      },
      {
        id: 120320,
        name: "查看试听活动"
      },
      {
        id: 120330,
        name: "删除试听活动"
      },
      {
        id: 120220,
        name: "咨询记录设置"
        // "type": "settings"
      },
      {
        id: 120250,
        name: "修改咨询记录的录入时间"
      },
      {
        id: 120230,
        name: "售前人员设置"
        // "ref": 120000,
        // "relType": "settings"
      },
      // {
      //     "id": 120260,
      //     "name": "编辑管辖校区咨询记录的采单员"
      // },
      {
        id: 120270,
        name: "分配咨询给电话销售"
      },
      {
        id: 120280,
        name: "分配咨询给副销售员"
      },
      {
        id: 120240,
        name: "公有池设置"
        // "ref": 120000,
        // "relType": "settings"
      },
      {
        id: 120290,
        name: "查看电话销售公有池并领取其中咨询"
      },
      {
        id: 120300,
        name: "查看销售员公有池并领取其中咨询"
      },
      {
        id: 120340,
        name: "设置标签词库"
      },
      {
        id: 120350,
        name: "转移咨询记录到公有池"
      }
    ]
  },
  {
    id: 240000,
    name: "市场分析",
    item: [
      {
        id: 240160,
        name: "售前管理分析",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240010,
        name: "咨询人数统计",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240020,
        name: "校区咨询量对比",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240030,
        name: "销售员/售前人员咨询量对比",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240040,
        name: "渠道分类咨询量对比",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240050,
        name: "渠道咨询量对比",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240060,
        name: "沟通记录分析",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240120,
        name: "试听记录统计",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240130,
        name: "试听任课老师统计",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240140,
        name: "试听操作人统计",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240150,
        name: "试听课程统计",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240070,
        name: "报名订单统计",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240080,
        name: "销售员/售前人员报名量对比",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240090,
        name: "销售来源报名量对比",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240100,
        name: "课程报名量对比",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240170,
        name: "渠道报名量对比",
        relType: "consolt",
        ref: 120000
      },
      {
        id: 240110,
        name: "报名学员分析",
        relType: "consolt",
        ref: 120000
      }
    ]
  },
  {
    id: 500000,
    name: "营销中心",
    item: [
      {
        id: 500010,
        name: "查看营销活动"
      },
      {
        id: 500020,
        name: "上架/下架、新建、编辑营销活动"
      },
      {
        id: 500030,
        name: "删除营销活动"
      }
    ]
  },
  {
    id: 130000,
    name: "办理中心",
    item: [
      {
        id: 130010,
        name: "查看经办人是我的订单",
        type: "radio"
      },
      {
        id: 130020,
        name: "查看管辖校区所有订单",
        type: "radio"
      },
      //   {
      //     id: 130030,
      //     name: "办理业务"
      //   },
        
      {
        id: 130021,
        name: "只允许查看未确认到款订单"
      },
      {
        id: 130023,
        name: "办理报名、续费、升期业务"
      },
      {
        id: 130024,
        name: "办理余额充值业务"
      },
      {
        id: 130025,
        name: "办理补费业务"
      },
      {
        id: 130026,
        name: "办理转课业务"
      },
      {
        id: 130027,
        name: "办理购买教材杂费业务"
      },
      {
        id: 130028,
        name: "办理退费业务"
      },
      {
        id: 130032,
        name: "增加学费优惠"
      },
      {
        id: 130033,
        name: "增加学费折扣"
      },
      {
        id: 130035,
        name: "批量续费/升期/转课"
      },
      {
        id: 130040,
        name: "编辑订单的全部信息（不包含经办日期）",
        type: "editOrder"
      },
      {
        id: 130041,
        name: "编辑订单的备注、流水单号、对方账号",
        type: "editOrder"
      },
      {
        id: 130045,
        name: "导出订单"
      },
      {
        id: 130050,
        name: "办理业务时，可修改经办日期"
      },
      {
        id: 130060,
        name: "查看管辖校区业务总计"
      },
      /*            {
                            "id": 130070,
                            "name": "前台打印交接单时，接收短信通知"
                        },*/
      {
        id: 130080,
        name: "前台办理退费时，接收短信通知"
      },
      {
        id: 130090,
        name: "新建订单标签"
      },
      {
        id: 130100,
        name: "办理积分业务"
      },
      {
        id: 130110,
        name: "跨校区办理业务、分班"
      },
      {
        id: 130120,
        name: "办理全部学员业务"
      },
      {
        id: 130140,
        name: "作废订单"
      }
    ]
  },
  {
    id: 140000,
    name: "课程",
    item: [
      {
        id: 140010,
        name: "查看、新建、编辑、删除所有校区的课程",
        type: "radio"
      },
      {
        id: 140012,
        name: "可查看全部课程，只允许编辑管辖校区的课程定价",
        type: "radio"
      },
      {
        id: 140015,
        name: "查看、新建、编辑、删除管辖校区范围内开课的课程",
        type: "radio"
      },
      {
        id: 140020,
        name: "导入课程"
      },
      {
        id: 140025,
        name: "课程类别设置"
      },
      {
        id: 140030,
        name: "科目设置"
      },
      {
        id: 140035,
        name: "查看、新建、编辑、删除升期关系"
      }
    ]
  },
  {
    id: 150000,
    name: "班级",
    item: [
      {
        id: 150010,
        name: "查看教师或助教是我的班级",
        type: "radio"
      },
      {
        id: 150020,
        name: "查看管辖校区所有班级",
        type: "radio"
      },
      {
        id: 150030,
        name: "新建班级"
      },
      {
        id: 150035,
        name: "导入班级"
      },
      {
        id: 150040,
        name: "编辑班级和操作结班"
      },
      {
        id: 150050,
        name: "删除班级"
      },
      {
        id: 150060,
        name: "查看班级详情页学员的已用学费/剩余学费"
      },
      {
        id: 150065,
        name: "查看班级详情页学员的课程总学费和欠费金额"
      },
      {
        id: 150070,
        name: "班级详情页操作添加学员"
      },
      {
        id: 150080,
        name: "班级详情页操作学员结课和同课程转班、改为在读"
      },
      {
        id: 150090,
        name: "班级详情页操作删除学员档案"
      },
      {
        id: 150100,
        name: "导出班级学员"
      },
      {
        id: 150110,
        name: "查看分班记录"
      },
      {
        id: 150120,
        name: "导出班级列表"
      }
    ]
  },
  {
    id: 160000,
    name: "一对一",
    item: [
      {
        id: 160010,
        name: "查看教师或助教是我的一对一",
        type: "radio"
      },
      {
        id: 160020,
        name: "查看管辖校区所有一对一",
        type: "radio"
      },
      {
        id: 160030,
        name: "查看一对一学员的已用学费/剩余学费"
      },
      {
        id: 160040,
        name: "编辑一对一"
      },
      {
        id: 160050,
        name: "导出一对一"
      }
    ]
  },
  {
    id: 170000,
    name: "排课",
    item: [
      {
        id: 170011,
        name: "查看教师或助教是我的日程",
        type: "look"
      },
      {
        id: 170012,
        name: "查看管辖校区的日程",
        type: "look"
      },
      {
        id: 170013,
        name: "新建、编辑教师或助教是我的日程",
        type: "edit"
      },
      {
        id: 170014,
        name: "新建、编辑管辖校区的日程",
        type: "edit"
      },
      {
        id: 170015,
        name: "删除教师或助教是我的日程",
        type: "delete"
      },
      {
        id: 170016,
        name: "删除管辖校区的日程",
        type: "delete"
      },
      {
        id: 170017,
        name: "排课设置"
      },
      {
        id: 170020,
        name: "允许在排课记录上调整学员"
      }
    ]
  },
  {
    id: 180000,
    name: "课程表",
    item: [
      {
        id: 180010,
        name: "查看教师或助教是我的日程",
        type: "radio"
      },
      {
        id: 180020,
        name: "查看管辖校区日程",
        type: "radio"
      }
    ]
  },
  {
    id: 190000,
    name: "学员",
    item: [
      {
        id: 190010,
        name: "查看我的学员",
        type: "radio"
      },
      {
        id: 190020,
        name: "查看管辖校区的学员",
        type: "radio"
      },
      {
        id: 190030,
        name: "查看学员学费情况"
      },
      {
        id: 190035,
        name: "查看、下载学员联系电话"
      },
      {
        id: 190040,
        name: "批量导入学员报名信息"
      },
      {
        id: 190045,
        name: "导出学员数据"
      },
      {
        id: 190047,
        name: "批量调整学员"
      },
      {
        id: 190050,
        name: "查看学员详情页-订单"
      },
      {
        id: 190060,
        name: "查看学员详情页-课程"
      },
      {
        id: 190065,
        name: "查看学员详情页-文件夹"
      },
      {
        id: 190067,
        name: "上传、删除、重命名、校宝家显示学员文件"
      },
      {
        id: 190070,
        name: "学员详情页操作标记为升期，分班/分教师，设置有效期" //乐高版本修改
        //"name": "学员详情页操作分班/分教师，设置有效期"
      },
      {
        id: 190080,
        name: "删除学员"
      },
      {
        id: 190090,
        name: "到期学员、欠费学员设置和提醒"
      },
      {
        id: 190025,
        name: "编辑学员基本信息"
      },
      {
        id: 190100,
        name: "查看并管理学员成绩"
      },
      {
        id: 190105,
        name: "办理停复课"
      },
      {
        id: 190110,
        name: "学员结课、取消结课"
      }
    ]
  },
  {
    id: 200000,
    name: "校宝家",
    item: [
      {
        id: 200010,
        name: "发送家长通知公告"
      },

      {
        id: 200020,
        name: "删除公告"
      },
      {
        id: 200031,
        name: "处理我的班级的申请",
        type: "sphapply"
      },
      {
        id: 200030,
        name: "处理我的管辖校区的申请",
        type: "sphapply"
      },
      {
        id: 200033,
        name: "给我的班级布置作业并查看作业",
        type: "homework"
      },
      {
        id: 200035,
        name: "给管辖校区所有班级布置作业并查看作业",
        type: "homework"
      },
      {
        id: 200036,
        name: "布置语音作业"
      },
      {
        id: 200037,
        name: "删除已布置作业"
      },
      {
        id: 200040,
        name: "查看管辖校区所有课程评价",
        type: "sphlessonrating"
      },
      {
        id: 200041,
        name: "查看上课教师或助教是我的评价",
        type: "sphlessonrating"
      },
      {
        id: 200060,
        name: "用户分析"
      },
      {
        id: 200070,
        name: "校宝家设置"
      },
      {
        id: 200080,
        name: "家长意见反馈"
      }
    ]
  },
  {
    id: 210000,
    name: "记上课",
    item: [
      {
        id: 210010,
        name: "查看我的班级/一对一的上课记录",
        type: "radio"
      },
      {
        id: 210020,
        name: "查看管辖校区所有班级/一对一的上课记录",
        type: "radio"
      },
      {
        id: 210022,
        name: "新建上课记录"
      },
      {
        id: 210024,
        name: "编辑上课记录"
      },
      {
        id: 210026,
        name: "新建/编辑上课记录时，允许修改教师课时数"
      },
      {
        id: 210028,
        name: "删除上课记录"
      },
      {
        id: 210030,
        name: "查看课时汇总"
      },
      {
        id: 210040,
        name: "查看上课记录列表页-学费消耗"
      },
      {
        id: 210050,
        name: "导出上课记录"
      },
      {
        id: 210060,
        name: "查看课时汇总学费消耗"
      },
      {
        id: 210025,
        name: "记上课时，允许添加或删除学员"
      },
      {
        id: 210080,
        name: "管理管辖校区补课学员"
      },
      {
        id: 210085,
        name: "批量编辑补课管理中的学员"
      }
    ]
  },
  //组织架构
  {
    id: 290000,
    name: "组织架构",
    item: [
      {
        id: 290010,
        name: "校区设置"
      },
      {
        id: 220033,
        name: "部门管理"
      },
      {
        id: 220034,
        name: "同步全机构的部门和员工到钉钉"
      }
    ]
  },
  {
    id: 220000,
    name: "员工",
    item: [
      {
        id: 220010,
        name: "员工查看"
      },
      {
        id: 220011,
        name: "员工新建、编辑"
      },
      {
        id: 220012,
        name: "员工删除"
      },
      {
        id: 220015,
        name: "员工导出"
      },
      {
        id: 220020,
        name: "管理员工的机构账号"
      },
      {
        id: 220021,
        name: "自定义账号权限"
      },
      {
        id: 220030,
        name: "角色管理"
      },
      {
        id: 220040,
        name: "人事变动调整"
      }
    ]
  },
  {
    id: 230000,
    name: "员工通知",
    item: [
      {
        id: 230010,
        name: "查看"
      },
      {
        id: 230020,
        name: "新建"
      },
      {
        id: 230030,
        name: "编辑、删除自己创建的通知",
        type: "radio"
      },
      {
        id: 230040,
        name: "编辑、删除所有通知",
        type: "radio"
      }
    ]
  },
  {
    id: 250000,
    name: "财务管理",
    item: [
      {
        id: 250010,
        name: "查看收支明细列表"
      },
      {
        id: 250020,
        name: "新增记账"
      },
      {
        id: 250030,
        name: "确认到款"
      },
      {
        id: 250031,
        name: "取消确认"
      },
      {
        id: 250040,
        name: "导出明细"
      },
      {
        id: 250050,
        name: "查看编辑账户列表"
      },
      {
        id: 250060,
        name: "新增账户"
      },
      {
        id: 250070,
        name: "删除账户"
      },
      {
        id: 250080,
        name: "新建编辑删除其他收入项目和支出项目"
      },
      {
        id: 250110,
        name: "账目未锁死时，可随时进行账目修改"
      },
      //   {
      //     id: 250120,
      //     name: "不受任何限制，可随时进行账目修改"
      //   },
      {
        id: 250900,
        name: "导出财务所有报表（华英）"
      },
      {
        id: 250905,
        name: "导出管辖校区报名员日结算明细表（华英）"
      },
      {
        id: 250910,
        name: "导出管辖校区班级预收款报表（华英）"
      }
    ]
  },
  {
    id: 255000,
    name: "报表",
    item: [
      {
        id: 255200,
        name: "查看校区经营报表"
      },
      {
        id: 255210,
        name: "查看教师报表"
      },
      {
        id: 255220,
        name: "查看班级报表"
      },
      {
        id: 255230,
        name: "查看上课记录报表"
      },
      {
        id: 255100,
        name: "查看学费消耗报表"
      },
      {
        id: 255110,
        name: "查看剩余学费报表"
      },
      {
        id: 255090,
        name: "查看收支流水报表"
      },
      {
        id: 255080,
        name: "查看交易流水报表"
      },
      {
        id: 255120,
        name: "查看教材杂费报表"
      },
      {
        id: 255240,
        name: "查看学管师报表"
      },
      {
        id: 255130,
        name: "导出报表"
      },
      {
        id: 255190,
        name: "校区汇总报表"
      }
    ]
  },
  {
    id: 260000,
    name: "磁卡考勤",
    item: [
      {
        id: 260010,
        name: "员工考勤记录"
      },
      {
        id: 260020,
        name: "员工刷卡"
      },
      {
        id: 260030,
        name: "学员刷卡记录"
      },
      {
        id: 260040,
        name: "刷卡找学员"
      },
      {
        id: 260050,
        name: "忘带磁卡"
      },
      {
        id: 260060,
        name: "学员刷卡"
      },
      {
        id: 260070,
        name: "磁卡机安装"
      },
      {
        id: 260080,
        name: "今日刷卡"
      }
    ]
  },
  //新库存权限
  {
    id: 280000,
    name: "教材",
    item: [
      {
        id: 280010,
        name: "查库存"
      },
      {
        id: 280020,
        name: "编辑删除库存变动记录"
      },
      {
        id: 280030,
        name: "教材设置"
      },
      {
        id: 280035,
        name: "批量导入教材"
      },
      {
        id: 280040,
        name: "导出库存/库存变动记录"
      },
      {
        id: 280050,
        name: "查看教材进价"
      },
      {
        id: 280060,
        name: "允许编辑/查看仓库库存"
      }
    ]
  },
  {
    id: 300000,
    name: "工作台",
    item: [
      {
        id: 300020,
        name: "数据分析"
      },
      {
        id: 300030,
        name: "今日总览"
      },
      {
        id: 300040,
        name: "使用向导"
      }
    ]
  },
  {
    id: 330000,
    name: "收银宝",
    item: [
      {
        id: 330010,
        name: "管理收银宝"
      }
    ]
  },
  {
    id: 480000,
    name: "机构中心",
    item: [
      {
        id: 480010,
        name: "机构信息"
      },
      {
        id: 480050,
        name: "工作台设置"
      },
      {
        id: 480060,
        name: "办理中心设置"
      },
      {
        id: 480070,
        name: "教务中心设置"
      },
      {
        id: 480080,
        name: "内部管理设置"
      },
      {
        id: 480090,
        name: "自定义设置"
      },
      {
        id: 480030,
        name: "系统日志"
      },
      {
        id: 480040,
        name: "自定义登录界面"
      },
      {
        id: 480085,
        name: "确认锁死账目"
      }
    ]
  },
  {
    id: 660000,
    name: "工资",
    item: [
      {
        id: 660010,
        name: "工资条"
      },
      {
        id: 660020,
        name: "绩效管理"
      },
      {
        id: 660030,
        name: "绩效设置"
      }
    ]
  },
  {
    id: 490000,
    name: "个人中心",
    item: [
      {
        id: 490010,
        name: "登录不受时限，可随时登录"
      }
    ]
  },
  {
    id: 10000000,
    name: "报表中心（PC端暂不支持，仅限移动端）",
    item: [
      {
        id: 10010700,
        name: "查看经营报告（日报/周报/月报）",
        ref: 10000000,
        fatherItem: "mobileReport"
      },
      {
        id: 10010500,
        name: "查看校区市场报表",
        sonItem: "mobileReport"
      },
      {
        id: 10010200,
        name: "查看校区教务报表",
        sonItem: "mobileReport"
      },
      {
        id: 10010100,
        name: "查看校区财务报表",
        sonItem: "mobileReport"
      },

      {
        id: 10010400,
        name: "查看我的市场报表"
      },
      {
        id: 10010600,
        name: "查看我的教务报表"
      }
    ]
  },
  {
    id: 270000,
    name: "校宝学院",
    item: [
      {
        id: 270015,
        name: "查看校宝学院"
      }
    ]
  }
];

dealTreeData(window.allTreeData)